tutorials/DXFlow/PerforatedBreakwater/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
   (-6.0     0.0    -0.4)
   (9.0      0.0    -0.4)
   (9.0      0.0    0.4)
   (-6.0     0.0    0.4)
   (-6.0     0.02   -0.4)
   (9.0      0.02   -0.4)
   (9.0      0.02   0.4)
   (-6.0     0.02   0.4)
);

blocks          
(
    hex (0 1 5 4 3 2 6 7)   (375 1 100) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall inlet 
    (
        (0 4 7 3)
    )
    wall outlet 
    (
        (1 5 6 2)
    )
    wall bottom 
    (
        (0 1 5 4)
    )
    patch atmosphere 
    (
        (3 2 6 7)
    )
    empty frontAndBack
    (
        (0 1 2 3)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
